QE/QE_wkspresent/workshop.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-05-03 Fri 12:56 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Quantum-ESPRESSO workshop <br />
</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Yavar T. Azar" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Quantum-ESPRESSO workshop <br />
</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org506af4b"><font color="gray">INTRODUCTION TO LINUX</font></a>
<ul>
<li><a href="#org03210ca">Some basic commands</a></li>
<li><a href="#orgb2f0eb9">Bash scripting (<i>for</i> and <i>while</i>  loops)</a></li>
</ul>
</li>
<li><a href="#orgba1aa48">Fisrt steps to PW</a>
<ul>
<li><a href="#org6fb9ea3">Excercise 1. (INPUT file)</a></li>
<li><a href="#orgbd5e465">SCF and convergency test for GaAs</a></li>
</ul>
</li>
<li><a href="#org574acda">Cell and atomic position relaxation</a></li>
<li><a href="#org3a1aa68">Post-Processing (Charge, Electrostatic Potential)</a></li>
<li><a href="#org38cc553">Post-Processing ( Dos and Projected Dos)</a></li>
<li><a href="#org89542e1">2D-Systems ( Making Slabs )</a></li>
</ul>
</div>
</div>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org506af4b"><font color="gray">INTRODUCTION TO LINUX</font></a>
<ul>
<li><a href="#org03210ca">Some basic commands</a></li>
<li><a href="#orgb2f0eb9">Bash scripting (<i>for</i> and <i>while</i>  loops)</a></li>
</ul>
</li>
<li><a href="#orgba1aa48">Fisrt steps to PW</a>
<ul>
<li><a href="#org6fb9ea3">Excercise 1. (INPUT file)</a></li>
<li><a href="#orgbd5e465">SCF and convergency test for GaAs</a></li>
</ul>
</li>
<li><a href="#org574acda">Cell and atomic position relaxation</a></li>
<li><a href="#org3a1aa68">Post-Processing (Charge, Electrostatic Potential)</a></li>
<li><a href="#org38cc553">Post-Processing ( Dos and Projected Dos)</a></li>
<li><a href="#org89542e1">2D-Systems ( Making Slabs )</a></li>
</ul>
</div>
</div>

<div id="outline-container-org506af4b" class="outline-2">
<h2 id="org506af4b"><font color="gray">INTRODUCTION TO LINUX</font></h2>
<div class="outline-text-2" id="text-org506af4b">
</div>
<div id="outline-container-org03210ca" class="outline-3">
<h3 id="org03210ca">Some basic commands</h3>
<div class="outline-text-3" id="text-org03210ca">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><b>ls</b></td>
<td class="org-left">directory listing</td>
</tr>

<tr>
<td class="org-left"><b>ls -al</b></td>
<td class="org-left">formatted listing with hidden files</td>
</tr>

<tr>
<td class="org-left"><b>cd dir</b></td>
<td class="org-left">change directory to dir</td>
</tr>

<tr>
<td class="org-left"><b>cd</b></td>
<td class="org-left">change to home</td>
</tr>

<tr>
<td class="org-left"><b>pwd</b></td>
<td class="org-left">show current directory</td>
</tr>

<tr>
<td class="org-left"><b>mkdir dir</b></td>
<td class="org-left">create a directory dir</td>
</tr>

<tr>
<td class="org-left"><b>rm file</b></td>
<td class="org-left">delete file</td>
</tr>

<tr>
<td class="org-left"><b>rm -r dir</b></td>
<td class="org-left">delete directory dir</td>
</tr>

<tr>
<td class="org-left"><b>rm -f file</b></td>
<td class="org-left">force remove file</td>
</tr>

<tr>
<td class="org-left"><b>rm -rf dir</b></td>
<td class="org-left">force remove directory dir *</td>
</tr>

<tr>
<td class="org-left"><b>cp file1 file2</b></td>
<td class="org-left">copy file1 to file2</td>
</tr>

<tr>
<td class="org-left"><b>cp -r dir1 dir2</b></td>
<td class="org-left">copy dir1 to dir2; create dir2 if it</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">doesn't exist</td>
</tr>

<tr>
<td class="org-left"><b>mv file1 file2</b></td>
<td class="org-left">rename or move file1 to file2</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">if file2 is an existing directory moves file1 into directory file2</td>
</tr>

<tr>
<td class="org-left"><b>ln -s file link</b></td>
<td class="org-left">create symbolic link link to file</td>
</tr>

<tr>
<td class="org-left"><b>touch file</b></td>
<td class="org-left">create or update file</td>
</tr>

<tr>
<td class="org-left"><b>cat &gt; file</b></td>
<td class="org-left">places standard input into file</td>
</tr>

<tr>
<td class="org-left"><b>more file</b></td>
<td class="org-left">output the contents of file</td>
</tr>

<tr>
<td class="org-left"><b>head file</b></td>
<td class="org-left">output the first 10 lines of file</td>
</tr>

<tr>
<td class="org-left"><b>tail file</b></td>
<td class="org-left">output the last 10 lines of file</td>
</tr>

<tr>
<td class="org-left"><b>tail -f file</b></td>
<td class="org-left">output the contents of file as it</td>
</tr>
</tbody>
</table>
</div>
</div>


<div id="outline-container-orgb2f0eb9" class="outline-3">
<h3 id="orgb2f0eb9">Bash scripting (<i>for</i> and <i>while</i>  loops)</h3>
</div>
</div>

<div id="outline-container-orgba1aa48" class="outline-2">
<h2 id="orgba1aa48">Fisrt steps to PW</h2>
<div class="outline-text-2" id="text-orgba1aa48">
</div>
<div id="outline-container-org6fb9ea3" class="outline-3">
<h3 id="org6fb9ea3">Excercise 1. (INPUT file)</h3>
<div class="outline-text-3" id="text-org6fb9ea3">
<ul class="org-ul">
<li>getting exp or computed structure from online databases</li>
<li>generating input files using easy tools</li>
<li>visulizing  them using <span class="underline">xcrysden</span>, <span class="underline">VESTA</span>, <span class="underline">gdis</span>, or <span class="underline">ase-gui</span> &#x2026;</li>
</ul>
</div>
</div>

<div id="outline-container-orgbd5e465" class="outline-3">
<h3 id="orgbd5e465">SCF and convergency test for GaAs</h3>
<div class="outline-text-3" id="text-orgbd5e465">
<p>
<font color="blue">In this exercise we will first perform simple scf (self-consistent field) calculations on GaAs structure</font>
</p>

<ul class="org-ul">
<li>STEP 1. Use Xcrysden to view the structure of input file and explore different utilities</li>
<li>STEP 2. Open and read the input file</li>
</ul>
<p>
Note that in the &amp;control namelist, we have specified that we want to run an <b>scf</b> calculation.<br />
GaAs has the diamond structure. Note that we are using a (primitive) unit cell that corresponds to an fcc lattice, with 2 atoms in the atomic basis.<br />
Notice the values given for ibrav, nat, ntyp and ATOMIC-POSITIONS.<br />
In this file, the lattice constant <font color="red">celldm(1)</font> has been set equal to 10.86626 bohr, which is the experimental value. <br />
A 2×2×2 Monkhorst-Pack <font color="red">k-point mesh.</font>  has been used. <br />
The plane-wave cut-off for wavefunctions, ecutwfc, has been set to 30 Ry. Since we are not using an ultrasoft pseudopotential. <br />
</p>

<ul class="org-ul">
<li>STEP 3. Run your input using following command</li>
</ul>

<p>
<code>cd ~/WORKSHOP_QE/BULK/SECTION-SCF</code>  <br />
<code>pw.x &lt; GaAs.scf.in | tee GaAs.scf.out</code>
</p>
</div>
</div>
</div>

<div id="outline-container-org574acda" class="outline-2">
<h2 id="org574acda">Cell and atomic position relaxation</h2>
</div>

<div id="outline-container-org3a1aa68" class="outline-2">
<h2 id="org3a1aa68">Post-Processing (Charge, Electrostatic Potential)</h2>
</div>

<div id="outline-container-org38cc553" class="outline-2">
<h2 id="org38cc553">Post-Processing ( Dos and Projected Dos)</h2>
</div>

<div id="outline-container-org89542e1" class="outline-2">
<h2 id="org89542e1">2D-Systems ( Making Slabs )</h2>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Yavar T. Azar</p>
<p class="date">Created: 2019-05-03 Fri 12:56</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
